src/Catalogs/Scan_СоглашенияОПоставке/Scan_СоглашенияОПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СоглашенияОПоставке</name>
  <basedOn>Catalog.Scan_СоглашенияОПоставке</basedOn>
  <basedOn>Catalog.Scan_СпециальныеУсловия</basedOn>
  <attributes>
    <name>DDS</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FFU</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>IDПродуктаКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SORDER</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческоеПредложениеSPORT</name>
    <type>
      <types>CatalogRef.Scan_КоммерческиеПредложения</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиентКомпания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кузовостроитель</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоПродукту</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоммерческогоПредложенияSPORT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоммерческогоПредложенияSPORTДляЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСОП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Scan_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецДилера</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РегиональныйМенеджер</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныеУсловия</name>
    <type>
      <types>CatalogRef.Scan_СпециальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартнаяСпецификация</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.Scan_ТипыСтатусовЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоглашенияОПоставке</name>
    <type>
      <types>EnumRef.Scan_ТипыСоглашенийОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальностьСпецификации</name>
    <type>
      <types>EnumRef.Scan_ТипыСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветКабины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФальшрадиаторнойРешетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСоглашенияОПоставке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяРазмещениеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявкиНаСОПSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДилераSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийSRUSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаБУПродукты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийИзУТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрепленныйМенеджерОКП</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютнаяОговорка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаАвтобусы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаРезерв</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходнаяЗаявка</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УсловияОплаты</name>
    <attributes>
      <name>ПроцентОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокОплатыАванса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетДатыОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыРасчетаДатыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПродуктов</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
        <types>CatalogRef.Scan_ДрафтыПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентДрайв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпециальныеУсловия</name>
      <type>
        <types>CatalogRef.Scan_СпециальныеУсловия</types>
      </type>
    </attributes>
    <attributes>
      <name>DDЗапрошенная</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DDS</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладОтгрузки</name>
      <type>
        <types>CatalogRef.Scan_Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Драйв</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоВалютнойОговорке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПерерасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикПлатежей</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/AccumulationRegisters/Scan_МестонахождениеИзделий/Scan_МестонахождениеИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Scan_МестонахождениеИзделий</name>
  <comment>Местонахождение продуктов (scania)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <type>
      <types>CatalogRef.Scan_ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПрихода</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Scan_ЗаявкаНаОтгрузку/Scan_ЗаявкаНаОтгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗаявкаНаОтгрузку</name>
  <posting>Deny</posting>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыЗаявокНаОтгрузку</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузкиВыходной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеОПоставке</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтгрузки</name>
    <type>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходнаяЗаявкаНаОтгрузку</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаНаОтгрузку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактныеЛица</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.Scan_КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтактнойИнформации</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Scan_СоглашенияОПоставке/Forms/ФормаНастройкиВводаЗаявкиНаОтгрузкуНаОсновании/Module.bsl
//rarus vikhle 14.09.2020 mt 16526 +++

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТекущееСоглашениеОПоставке") Тогда
		ТекущееСоглашениеОПоставке = Параметры.ТекущееСоглашениеОПоставке;
		УстановитьУсловноеОформление(); //rarus vikhle 30.09.2020 mt 16526
		ЗаполнитьТаблицы();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	
	ПараметрыОтбора = Новый Структура("Флаг",Истина);
	МассивВыделенныхСтрок = СписокПродуктов.НайтиСтроки(ПараметрыОтбора);
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда
		ВывестиСообщениеПол("Не выбраны продукты!");
		Возврат;
	КонецЕсли;	
	
	МассивВыделенныхПродуктов = Новый Массив;
	ЭтоПервыйЭлемент = Истина;
	СкладыОтличаются = Ложь;
	ПредыдущийСклад  = Ложь;
	Для Каждого ЭлементМассива Из МассивВыделенныхСтрок Цикл
		Если ЭлементМассива.СкладОтгрузки.Пустая() Тогда
			//ВывестиСообщениеПол("У продукта %1 не заполнен склад.",,,,,ЭлементМассива.Продукт);
			ВывестиСообщениеПол("У продукта %1 не заполнено запрашиваемое место передачи.",,,,,ЭлементМассива.Продукт); //rarus vikhle 20.01.2021 mt 16981
			Возврат;		
		КонецЕсли;	
		Если НЕ ЭтоПервыйЭлемент Тогда
			Если НЕ ПредыдущийСклад = ЭлементМассива.СкладОтгрузки Тогда  
				СкладыОтличаются = Истина;
				//ВывестиСообщениеПол("У выбранных продуктов различаются склады, создание заявки на отгрузку невозможно.");
				ВывестиСообщениеПол("У выбранных продуктов различаются запрашиваемые места передачи, создание заявки на отгрузку невозможно."); //rarus vikhle 20.01.2021 mt 16981
				Возврат;
			КонецЕсли;
		КонецЕсли;
		ПредыдущийСклад = ЭлементМассива.СкладОтгрузки; 
		ЭтоПервыйЭлемент = Ложь;
		МассивВыделенныхПродуктов.Добавить(ЭлементМассива.Продукт);
	КонецЦикла;	
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Основание", ТекущееСоглашениеОПоставке);
	ПараметрыОткрытия.Вставить("СкладОтгрузки", ПредыдущийСклад);
	ПараметрыОткрытия.Вставить("СписокПродуктов",МассивВыделенныхПродуктов);
	ФормаЗаявки = ОткрытьФорму("Документ.Scan_ЗаявкаНаОтгрузку.ФормаОбъекта", ПараметрыОткрытия,ЭтотОбъект);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДляВыбранных(Команда)
	Если НЕ СкладОтгрузки.Пустая() Тогда
		Для Каждого СтрокаСписка Из СписокПродуктов Цикл
			Если СтрокаСписка.Флаг Тогда
				СтрокаСписка.СкладОтгрузки = СкладОтгрузки;
			КонецЕсли;	
		КонецЦикла;	
	Иначе
		//ВывестиСообщениеПол("Не заполнен склад!",ЭтотОбъект,"СкладОтгрузки");
		ВывестиСообщениеПол("Не заполнено запрашиваемое место передачи!",ЭтотОбъект,"СкладОтгрузки"); //rarus vikhle 20.01.2021 mt 16981
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьСклады(Команда)
	Для Каждого СтрокаСписка Из СписокПродуктов Цикл
		СтрокаСписка.СкладОтгрузки = СтрокаСписка.СкладОтгрузкиСоглашения;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого СтрокаСписка Из СписокПродуктов Цикл
		СтрокаСписка.Флаг = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого СтрокаСписка Из СписокПродуктов Цикл
		СтрокаСписка.Флаг = Ложь;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицы()
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ.Scan_ЗаявкаНаОтгрузку) КАК ЗаявкаНаОтгрузку,
	               |	СвязанныеДокументы.Ссылка.СкладОтгрузки КАК СсылкаСкладОтгрузки,
	               |	Scan_ЗаявкаНаОтгрузкуПродукты.Продукт КАК Продукт,
	               |	СвязанныеДокументы.Ссылка.Статус КАК СтатусЗаявки
	               |ПОМЕСТИТЬ ДанныеЗаявок
	               |ИЗ
	               |	КритерийОтбора.СвязанныеДокументы(&ТекущееСоглашениеОПоставке) КАК СвязанныеДокументы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Scan_ЗаявкаНаОтгрузку.Продукты КАК Scan_ЗаявкаНаОтгрузкуПродукты
	               |		ПО СвязанныеДокументы.Ссылка = Scan_ЗаявкаНаОтгрузкуПродукты.Ссылка
	               |ГДЕ
	               |	НЕ СвязанныеДокументы.Ссылка ЕСТЬ NULL
	               |	И СвязанныеДокументы.Ссылка ССЫЛКА Документ.Scan_ЗаявкаНаОтгрузку
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеЗаявок.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку,
	               |	ДанныеЗаявок.СсылкаСкладОтгрузки КАК СкладОтгрузки,
	               |	ДанныеЗаявок.Продукт КАК Продукт,
	               |	ДанныеЗаявок.СтатусЗаявки КАК СтатусЗаявки
	               |ИЗ
	               |	ДанныеЗаявок КАК ДанныеЗаявок
	               |ИТОГИ ПО
	               |	СтатусЗаявки,
	               |	ЗаявкаНаОтгрузку";	
	Запрос.УстановитьПараметр("ТекущееСоглашениеОПоставке",ТекущееСоглашениеОПоставке);
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЗначениеВРеквизитФормы(Дерево, "ДеревоЗаявок");
	Элементы.ДеревоЗаявок.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
		
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Scan_СоглашенияОПоставкеСписокПродуктов.Продукт КАК Справочник.Scan_Изделия) КАК Продукт,
	|	Scan_СоглашенияОПоставкеСписокПродуктов.СкладОтгрузки КАК СкладОтгрузки
	// rarus agar 29.04.2021 17665 ++
	//|ПОМЕСТИТЬ ДоступныеПродукты
	|ПОМЕСТИТЬ ВТ_ДоступныеПродукты
	// rarus agar 29.04.2021 17665 --
	|ИЗ
	|	Справочник.Scan_СоглашенияОПоставке.СписокПродуктов КАК Scan_СоглашенияОПоставкеСписокПродуктов
	|ГДЕ
	|	Scan_СоглашенияОПоставкеСписокПродуктов.Продукт ССЫЛКА Справочник.Scan_Изделия
	|	И Scan_СоглашенияОПоставкеСписокПродуктов.Ссылка = &ТекущееСоглашениеОПоставке
	|	И НЕ Scan_СоглашенияОПоставкеСписокПродуктов.Продукт В
	|				(ВЫБРАТЬ
	|					ДанныеЗаявок.Продукт
	|				ИЗ
	|					ДанныеЗаявок КАК ДанныеЗаявок
	|				ГДЕ
	|					НЕ ДанныеЗаявок.ЗаявкаНаОтгрузку.Статус В (ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаОтгрузку.Отказ), ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаОтгрузку.Отменена))
	|					И НЕ ДанныеЗаявок.ЗаявкаНаОтгрузку.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеПродукты.Продукт КАК Продукт,
	|	ДоступныеПродукты.СкладОтгрузки КАК СкладОтгрузки,
	|	ДоступныеПродукты.СкладОтгрузки КАК СкладОтгрузкиСоглашения,
	|	Scan_СводнаяИнформацияПоПродукту.DD КАК DD,
	|	Scan_СводнаяИнформацияПоПродукту.DDS КАК DDS,
	// rarus agar 29.04.2021 17665 ++
	|	Scan_СводнаяИнформацияПоПродукту.DD2 КАК DD2,
	|	Scan_МестонахождениеИзделийОстатки.МестоХранения КАК Местонахождение
	// rarus agar 29.04.2021 17665 --
	|ИЗ
	|	ВТ_ДоступныеПродукты КАК ДоступныеПродукты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_СводнаяИнформацияПоПродукту КАК Scan_СводнаяИнформацияПоПродукту
	|		ПО ДоступныеПродукты.Продукт = Scan_СводнаяИнформацияПоПродукту.Продукт
	// rarus agar 29.04.2021 17665 ++
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Scan_МестонахождениеИзделий.Остатки(
	|				,
	|				Изделие В
	|					(ВЫБРАТЬ
	|						ВТ_ДоступныеПродукты.Продукт
	|					ИЗ
	|						ВТ_ДоступныеПродукты)) КАК Scan_МестонахождениеИзделийОстатки
	|		ПО ДоступныеПродукты.Продукт = Scan_МестонахождениеИзделийОстатки.Изделие
	// rarus agar 29.04.2021 17665 --
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоступныеПродукты.СкладОтгрузки.Наименование";
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	СписокПродуктов.Загрузить(РезультатЗапроса);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДоступныеПродукты.СкладОтгрузки КАК СкладОтгрузки
	               |ИЗ
	               |	ВТ_ДоступныеПродукты КАК ДоступныеПродукты  // rarus agar 29.04.2021 17665 +-
	               |ГДЕ
	               |	НЕ ДоступныеПродукты.СкладОтгрузки = ЗНАЧЕНИЕ(Справочник.Scan_МестаХранения.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Для Каждого СтрокаСписка Из СписокПродуктов Цикл 
			СтрокаСписка.Флаг = Истина;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//rarus vikhle 30.09.2020 mt 16526 +++
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_СтатусыЗаявокНаОтгрузку.Ссылка КАК Статус,
	               |	Scan_СтатусыЗаявокНаОтгрузку.ЦветФона КАК ЦветФона,
	               |	Scan_СтатусыЗаявокНаОтгрузку.ЦветТекста КАК ЦветТекста
	               |ИЗ
	               |	Справочник.Scan_СтатусыЗаявокНаОтгрузку КАК Scan_СтатусыЗаявокНаОтгрузку";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элемент = УсловноеОформление.Элементы.Добавить();

		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоЗаявокСтатусЗаявки.Имя);
		ПолеЭлемента.Использование = Истина;
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЗаявок.СтатусЗаявки");
	    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Выборка.Статус;
		ОтборЭлемента.Использование = Истина;
		
		ЦветФонаСтатуса = Выборка.ЦветФона.Получить();
		Если НЕ ЦветФонаСтатуса = Неопределено Тогда
			Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФонаСтатуса);
		КонецЕсли;
		
		ЦветТекстаСтатуса = Выборка.ЦветТекста.Получить();
		Если НЕ ЦветТекстаСтатуса = Неопределено Тогда
			Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекстаСтатуса);
		КонецЕсли;
	КонецЦикла;	
	///rarus vikhle 30.09.2020 mt 16526 ---
КонецПроцедуры	

#КонецОбласти

//rarus vikhle 14.09.2020 mt 16526 ---
